# VisibilityType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyElementVisibility..::..VisibilityType Property
FamilyElementVisibility Class See Also
---
Indicates if the instance is Model or View specific.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyElementVisibilityType VisibilityType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VisibilityType As FamilyElementVisibilityType
	Get
```

Visual C++
---
```text
public:
property FamilyElementVisibilityType VisibilityType {
	FamilyElementVisibilityType get ();
}
```

# See Also
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace